# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # [depth, width, max_channels]
  n: [0.50, 0.25, 512]
  s: [2.00, 0.50, 384]
  m: [0.50, 0.75, 384]
  l: [1.00, 0.75, 384]
  x: [1.00, 1.00, 384]
# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2_WDC, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_WDC, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 1, LGTConvNeckLite, [192, 192, 3, 1, 1]]
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 1, LGTConvNeckLite, [128, 128, 3, 1, 1]] 
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-1, 1, LGTConvNeckLite_WT, [96, 96, 3, 1, 1]] 
  - [[-1, 2], 1, Concat, [1]] 
  - [-1, 2, C3k2_WDC, [128, False, 0.25]] 

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 18], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]]

  - [[22, 25], 1, Detect_LSDECD_DWTP2GateLite, [nc,192]] # Detect(P2,P3)
